In [1]:
import pandas as pd

# Series

In [2]:
pd.Series

pandas.core.series.Series

In [3]:
print(pd.Series.__doc__)

    One-dimensional ndarray with axis labels (including time series).

    Labels need not be unique but must be a hashable type. The object
    supports both integer- and label-based indexing and provides a host of
    methods for performing operations involving the index. Statistical
    methods from ndarray have been overridden to automatically exclude
    missing data (currently represented as NaN).

    Operations between Series (+, -, /, *, **) align values based on their
    associated index values-- they need not be the same length. The result
    index will be the sorted union of the two indexes.

    Parameters
    ----------
    data : array-like, Iterable, dict, or scalar value
        Contains data stored in Series.

        .. versionchanged:: 0.23.0
           If data is a dict, argument order is maintained for Python 3.6
           and later.

    index : array-like or Index (1d)
        Values must be hashable and have the same length as `data`.
        Non-unique index values are allowed. Will default to
        RangeIndex (0, 1, 2, ..., n) if not provided. If both a dict and index
        sequence are used, the index will override the keys found in the
        dict.
    dtype : str, numpy.dtype, or ExtensionDtype, optional
        Data type for the output Series. If not specified, this will be
        inferred from `data`.
        See the :ref:`user guide <basics.dtypes>` for more usages.
    name : str, optional
        The name to give to the Series.
    copy : bool, default False
        Copy input data.

In [4]:
l=list(range(-5,50,5))
l

[-5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [5]:
pd.Series(l)

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [6]:
pd.Series(range(-5,50,5))

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [7]:
pd.Series(range(-5,50,5), name='x5 series')

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
Name: x5 series, dtype: int64

In [8]:
pd.Series(5)

0    5
dtype: int64

In [9]:
dct={
    'apples':10,
    'cucumbers':3,
    'bread':5,
    'bacon':2,
    'water':10,
    'wine':4
}

In [10]:
pd.Series(dct, name='picnic')

apples       10
cucumbers     3
bread         5
bacon         2
water        10
wine          4
Name: picnic, dtype: int64

In [11]:
pd.Series({'a':[0,1,2,3,4,5], 'b':[0,1,4,9,16,25],'c':[0,-1,-2,-3,-4,-5]})

a         [0, 1, 2, 3, 4, 5]
b       [0, 1, 4, 9, 16, 25]
c    [0, -1, -2, -3, -4, -5]
dtype: object

In [12]:
s=pd.Series(dct, name='picnic')

## Attributes

In [13]:
s.dtype

dtype('int64')

In [14]:
#if there are missing data in the series
s.hasnans

False

In [18]:
import numpy as np
s['camera']=np.nan
s.hasnans

True

In [15]:
#get the index
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'wine'], dtype='object')

In [19]:
s.values

array([10.,  3.,  5.,  2., 10.,  4., nan])

In [20]:
s.dtype

dtype('float64')

In [21]:
s

apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
wine          4.0
camera        NaN
Name: picnic, dtype: float64

In [22]:
s.size

7

In [23]:
s.shape

(7,)

In [24]:
s.name

'picnic'

## Methods

### Indexation

In [27]:
# returns the top 5 rows by default, can be changed by passing a value 
s.head()

apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
Name: picnic, dtype: float64

In [29]:
s.tail(3)

water     10.0
wine       4.0
camera     NaN
Name: picnic, dtype: float64

In [30]:
s.sample(3)

apples    10.0
wine       4.0
camera     NaN
Name: picnic, dtype: float64

In [31]:
s['wine']

4.0

In [32]:
s.wine

4.0

In [33]:
s[['apples','wine']]

apples    10.0
wine       4.0
Name: picnic, dtype: float64

In [40]:
s[['bread','camera']]

bread     5.0
camera    NaN
Name: picnic, dtype: float64

In [41]:
s.loc[['bread','camera']]

bread     5.0
camera    NaN
Name: picnic, dtype: float64

In [42]:
s.loc['bread':'camera']

bread      5.0
bacon      2.0
water     10.0
wine       4.0
camera     NaN
Name: picnic, dtype: float64

In [44]:
pd.Series(l).loc[4:7]

4    15
5    20
6    25
7    30
dtype: int64

In [45]:
s

apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
wine          4.0
camera        NaN
Name: picnic, dtype: float64

In [47]:
s.iloc[0:3]

apples       10.0
cucumbers     3.0
bread         5.0
Name: picnic, dtype: float64

In [49]:
s.loc['apples':'bread']

apples       10.0
cucumbers     3.0
bread         5.0
Name: picnic, dtype: float64

# DataFrame

In [50]:
pd.DataFrame

pandas.core.frame.DataFrame

In [51]:
print(pd.DataFrame.__doc__)

    Two-dimensional, size-mutable, potentially heterogeneous tabular data.

    Data structure also contains labeled axes (rows and columns).
    Arithmetic operations align on both row and column labels. Can be
    thought of as a dict-like container for Series objects. The primary
    pandas data structure.

    Parameters
    ----------
    data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
        Dict can contain Series, arrays, constants, or list-like objects.

        .. versionchanged:: 0.23.0
           If data is a dict, column order follows insertion-order for
           Python 3.6 and later.

        .. versionchanged:: 0.25.0
           If data is a list of dicts, column order follows insertion-order
           for Python 3.6 and later.

    index : Index or array-like
        Index to use for resulting frame. Will default to RangeIndex if
        no indexing information part of input data and no index provided.
    columns : Index or array-like
        Column labels to use for resulting frame. Will default to
        RangeIndex (0, 1, 2, ..., n) if no column labels are provided.
    dtype : dtype, default None
        Data type to force. Only a single dtype is allowed. If None, infer.
    copy : bool, default False
        Copy data from inputs. Only affects DataFrame / 2d ndarray input.

    See Also
    --------
    DataFrame.from_records : Constructor from tuples, also record arrays.
    DataFrame.from_dict : From dicts of Series, arrays, or dicts.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_table : Read general delimited file into DataFrame.
    read_clipboard : Read text from clipboard into DataFrame.

    Examples
    --------
    Constructing DataFrame from a dictionary.

    >>> d = {'col1': [1, 2], 'col2': [3, 4]}
    >>> df = pd.DataFrame(data=d)
    >>> df
       col1  col2
    0     1     3
    1     2     4

    Notice that the inferred dtype is int64.

    >>> df.dtypes
    col1    int64
    col2    int64
    dtype: object

    To enforce a single dtype:

    >>> df = pd.DataFrame(data=d, dtype=np.int8)
    >>> df.dtypes
    col1    int8
    col2    int8
    dtype: object

    Constructing DataFrame from numpy ndarray:

    >>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
    ...                    columns=['a', 'b', 'c'])
    >>> df2
       a  b  c
    0  1  2  3
    1  4  5  6
    2  7  8  9

In [53]:
pd.DataFrame(l)

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

In [55]:
pd.DataFrame(l, columns=['col1'])

    col1
0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45

In [57]:
ll=[[i for i in range(j,j+5)] for j in range(10)]
ll

[[0, 1, 2, 3, 4],
 [1, 2, 3, 4, 5],
 [2, 3, 4, 5, 6],
 [3, 4, 5, 6, 7],
 [4, 5, 6, 7, 8],
 [5, 6, 7, 8, 9],
 [6, 7, 8, 9, 10],
 [7, 8, 9, 10, 11],
 [8, 9, 10, 11, 12],
 [9, 10, 11, 12, 13]]

In [59]:
pd.DataFrame(ll, columns=list('ABCDE'))

   A   B   C   D   E
0  0   1   2   3   4
1  1   2   3   4   5
2  2   3   4   5   6
3  3   4   5   6   7
4  4   5   6   7   8
5  5   6   7   8   9
6  6   7   8   9  10
7  7   8   9  10  11
8  8   9  10  11  12
9  9  10  11  12  13

In [64]:
pd.DataFrame({'a':[0,1,2,3,4,5], 'b':[0,1,4,9,16,25],'c':[0,-1,-2,-3,-4,np.nan]})

   a   b    c
0  0   0  0.0
1  1   1 -1.0
2  2   4 -2.0
3  3   9 -3.0
4  4  16 -4.0
5  5  25  NaN

In [71]:
s

apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
wine          4.0
camera        NaN
Name: picnic, dtype: float64

In [70]:
pd.DataFrame(s)

           picnic
apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
wine          4.0
camera        NaN

In [66]:
s.to_frame()

           picnic
apples       10.0
cucumbers     3.0
bread         5.0
bacon         2.0
water        10.0
wine          4.0
camera        NaN

In [72]:
#More concrete example
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']


house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

pd.DataFrame(house_dict)

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [75]:
df=pd.DataFrame(house_dict).T
df.columns=colnames

In [76]:
df

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [80]:
pd.DataFrame(house_dict, index=colnames).T

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [82]:
pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [84]:
df=pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

## Attributes

In [85]:
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [86]:
df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [87]:
df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [88]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [89]:
df.size

50

In [90]:
df.shape

(10, 5)

## Methods
### Indexation

In [91]:
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [92]:
df.tail()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [98]:
df.sample()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Dominguez House    14260      NoRidge       2000        8     250000

In [99]:
df['Quality']

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [100]:
df.Quality

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [103]:
df.columns=['LotSize', 'Neighborhood', 'Year Built', 'Quality', 'SalePrice']

In [104]:
df['Year Built']

Baker House        1939
Beazley House      1993
Dominguez House    2000
Hamilton House     1931
James House        2001
Martinez House     1976
Roberts House      1915
Smith House        2003
Snyder House       2004
Zuckerman House    1973
Name: Year Built, dtype: int64

In [105]:
df.Year Built

SyntaxError: invalid syntax (<ipython-input-105-a11b11c7c891>, line 1)

In [106]:
df[['LotSize','Quality']]

                 LotSize  Quality
Baker House         7420        5
Beazley House      14115        5
Dominguez House    14260        8
Hamilton House      6120        7
James House        11250        7
Martinez House      9600        6
Roberts House       9550        7
Smith House         8450        7
Snyder House       10084        8
Zuckerman House    10382        7

In [108]:
df['Zuckerman House']

KeyError: 'Zuckerman House'

In [109]:
df.loc['Zuckerman House']

LotSize          10382
Neighborhood    NWAmes
Year Built        1973
Quality              7
SalePrice       200000
Name: Zuckerman House, dtype: object

In [110]:
df.loc[['Zuckerman House','Snyder House']]

                 LotSize Neighborhood  Year Built  Quality  SalePrice
Zuckerman House    10382       NWAmes        1973        7     200000
Snyder House       10084      Somerst        2004        8     307000

In [113]:
df.loc['Zuckerman House','LotSize']

10382

In [115]:
df.loc[['Beazley House','Snyder House'],'LotSize']

Beazley House    14115
Snyder House     10084
Name: LotSize, dtype: int64

In [116]:
df.loc[['Beazley House','Snyder House'],['LotSize','Quality']]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

In [117]:
df.loc['Beazley House':'Snyder House']

                 LotSize Neighborhood  Year Built  Quality  SalePrice
Beazley House      14115      Mitchel        1993        5     143000
Dominguez House    14260      NoRidge        2000        8     250000
Hamilton House      6120      OldTown        1931        7     129900
James House        11250      CollgCr        2001        7     223500
Martinez House      9600      Veenker        1976        6     181500
Roberts House       9550      Crawfor        1915        7     140000
Smith House         8450      CollgCr        2003        7     208500
Snyder House       10084      Somerst        2004        8     307000

In [118]:
df.loc['Beazley House':'Snyder House', 'Quality']

Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Name: Quality, dtype: int64

In [119]:
df.loc['Beazley House':'Snyder House', ['LotSize','Quality']]

                 LotSize  Quality
Beazley House      14115        5
Dominguez House    14260        8
Hamilton House      6120        7
James House        11250        7
Martinez House      9600        6
Roberts House       9550        7
Smith House         8450        7
Snyder House       10084        8

In [120]:
df.loc['Beazley House':'Snyder House', 'LotSize':'Quality']

                 LotSize Neighborhood  Year Built  Quality
Beazley House      14115      Mitchel        1993        5
Dominguez House    14260      NoRidge        2000        8
Hamilton House      6120      OldTown        1931        7
James House        11250      CollgCr        2001        7
Martinez House      9600      Veenker        1976        6
Roberts House       9550      Crawfor        1915        7
Smith House         8450      CollgCr        2003        7
Snyder House       10084      Somerst        2004        8

In [121]:
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
Year Built         1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [122]:
df.iloc[[1,-2]]

               LotSize Neighborhood  Year Built  Quality  SalePrice
Beazley House    14115      Mitchel        1993        5     143000
Snyder House     10084      Somerst        2004        8     307000

In [124]:
df.iloc[:,2]

Baker House        1939
Beazley House      1993
Dominguez House    2000
Hamilton House     1931
James House        2001
Martinez House     1976
Roberts House      1915
Smith House        2003
Snyder House       2004
Zuckerman House    1973
Name: Year Built, dtype: int64

In [125]:
df.iloc[[1,-2],[0,-2]]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

In [126]:
df.iloc[1:-2]

                 LotSize Neighborhood  Year Built  Quality  SalePrice
Beazley House      14115      Mitchel        1993        5     143000
Dominguez House    14260      NoRidge        2000        8     250000
Hamilton House      6120      OldTown        1931        7     129900
James House        11250      CollgCr        2001        7     223500
Martinez House      9600      Veenker        1976        6     181500
Roberts House       9550      Crawfor        1915        7     140000
Smith House         8450      CollgCr        2003        7     208500

In [127]:
df.iloc[1:-2,1:-2]

                Neighborhood  Year Built
Beazley House        Mitchel        1993
Dominguez House      NoRidge        2000
Hamilton House       OldTown        1931
James House          CollgCr        2001
Martinez House       Veenker        1976
Roberts House        Crawfor        1915
Smith House          CollgCr        2003

In [129]:
df.iloc[:, :2]

                 LotSize Neighborhood
Baker House         7420      BrkSide
Beazley House      14115      Mitchel
Dominguez House    14260      NoRidge
Hamilton House      6120      OldTown
James House        11250      CollgCr
Martinez House      9600      Veenker
Roberts House       9550      Crawfor
Smith House         8450      CollgCr
Snyder House       10084      Somerst
Zuckerman House    10382       NWAmes

In [142]:
import os
os.chdir(r'D:\Documents\Ironhack\Slides\vehicles/vehicles')

### Import / Export

In [138]:
df=pd.read_csv(r'D:\Documents\Ironhack\Slides\vehicles/vehicles/vehicles.csv')
df.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [141]:
df.to_csv('df.csv', index=False)

In [145]:
df=pd.read_csv('vehicles_tab.txt', sep='\t')
df.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [146]:
df=pd.read_csv('vehicles_pipe.txt', sep='|')
df.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [152]:
df.to_csv('pipefile.jpg', sep=' ', index=False)

In [156]:
!pip install --upgrade pandas

^C

In [155]:
pd.read_excel('vehicles.xlsx')

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
35947,smart,fortwo coupe,2013,1.0,3,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,244.000000,1100
35948,smart,fortwo coupe,2014,1.0,3,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,243.000000,1100
35949,smart,fortwo coupe,2015,1.0,3,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,244.000000,1100
35950,smart,fortwo coupe,2016,0.9,3,Auto(AM6),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,39,36,246.000000,1100
35951,smart,fortwo coupe,2016,0.9,3,Manual 5-spd,Rear-Wheel Drive,Two Seaters,Premium,9.417429,32,39,35,255.000000,1150

In [157]:
df.to_excel('filename.xlsx', index=False)

In [159]:
pd.read_json('vehicles.json').head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [160]:
df.to_json('blaaaah.json', orient='split')

In [161]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\eldiy\anaconda3\lib\site-packages (0.9.3)

In [162]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\eldiy\anaconda3\lib\site-packages (1.3.11)

In [164]:
!pip install getpass3

Collecting getpass3
  Downloading https://files.pythonhosted.org/packages/f4/c3/98b137d1de14e76b49147aae9c8ed49ca12a8ebb7c1de9b4207301ef80b2/getpass3-1.2.tar.gz
Building wheels for collected packages: getpass3
  Building wheel for getpass3 (setup.py): started
  Building wheel for getpass3 (setup.py): finished with status 'done'
  Created wheel for getpass3: filename=getpass3-1.2-cp36-none-any.whl size=1781 sha256=06c0d067bc5a1dd0cf306a886864c27fd23cc761558c968d273e06216e0ee4cb
  Stored in directory: C:\Users\eldiy\AppData\Local\pip\Cache\wheels\83\f8\83\9e10cd25c32c3d4111f549a84b16d39df653f38c5c96f42534
Successfully built getpass3
Installing collected packages: getpass3
Successfully installed getpass3-1.2

In [165]:
import pymysql
from sqlalchemy import create_engine
from getpass import getpass

In [180]:
#credentials
username='root'
server='localhost'
database=''
password=getpass()

In [181]:
engine=create_engine(f'mysql+pymysql://{username}:{password}@{server}/{database}')

In [183]:
df=pd.read_sql_query("select * from authors", engine)

In [170]:
pd.read_sql_table('employee',engine)

       emp_id      fname minit      lname  job_id  job_lvl pub_id  hire_date
0   A-C71970F       Aria             Cruz      10       87   1389 1991-10-26
1   A-R89858F    Annette           Roulet       6      152   9999 1990-02-21
2   AMD15433F        Ann     M      Devon       3      200   9952 1991-07-16
3   ARD36773F    Anabela     R  Domingues       8      100   0877 1993-01-27
4   CFH28514M     Carlos     F   Hernadez       5      211   9999 1989-04-21
5   CGS88322F     Carine     G    Schmitt      13       64   1389 1992-07-07
6   DBT39435M     Daniel     B     Tonini      11       75   0877 1990-01-01
7   DWR65030M      Diego     W       Roel       6      192   1389 1991-12-16
8   ENL44273F  Elizabeth     N    Lincoln      14       35   0877 1990-07-24
9   F-C16315M  Francisco            Chang       4      227   9952 1990-11-03
10  GHT50241M       Gary     H     Thomas       9      170   0736 1988-08-09
11  H-B39728F      Helen          Bennett      12       35   0877 1989-09-21
12  HAN90777M  Helvetius     A       Nagy       7      120   9999 1993-03-19
13  HAS54740M     Howard     A     Snyder      12      100   0736 1988-11-19
14  JYL26161F     Janine     Y    Labrune       5      172   9901 1991-05-26
15  KFJ64308F      Karin     F    Josephs      14      100   0736 1992-10-17
16  KJJ92907F      Karla     J  Jablonski       9      170   9999 1994-03-11
17  L-B31947F     Lesley            Brown       7      120   0877 1991-02-13
18  LAL21447M   Laurence     A    Lebihan       5      175   0736 1990-06-03
19  M-L67958F      Maria          Larsson       7      135   1389 1992-03-27
20  M-P91209M     Manuel          Pereira       8      101   9999 1989-01-09
21  M-R38834F    Martine            Rance       9       75   0877 1992-02-05
22  MAP77183M     Miguel     A    Paolino      11      112   1389 1992-12-07
23  MAS70474F   Margaret     A      Smith       9       78   1389 1988-09-29
24  MFS52347M     Martin     F     Sommer      10      165   0736 1990-04-13
25  MGK44605M      Matti     G  Karttunen       6      220   0736 1994-05-01
26  MJP25939M      Maria     J     Pontes       5      246   1756 1989-03-01
27  MMS49649F       Mary     M    Saveley       8      175   0736 1993-06-29
28  PCM98509F   Patricia     C    McKenna      11      150   9999 1989-08-01
29  PDI47470M      Palle     D      Ibsen       7      195   0736 1993-05-09
30  PHF38899M      Peter     H    Franken      10       75   0877 1992-05-17
31  PMA42628M      Paolo     M    Accorti      13       35   0877 1992-08-27
32  POK93028M     Pirkko     O  Koskitalo      10       80   9999 1993-11-29
33  PSA89086M      Pedro     S     Afonso      14       89   1389 1990-12-24
34  PSP68661F      Paula     S    Parente       8      125   1389 1994-01-19
35  PTC11962M     Philip     T     Cramer       2      215   9952 1989-11-11
36  PXH22250M       Paul     X    Henriot       5      159   0877 1993-08-19
37  R-M53550M     Roland           Mendel      11      150   0736 1991-09-05
38  RBM23061F       Rita     B     Muller       5      198   1622 1993-10-09
39  SKO22412M       Sven     K    Ottlieb       5      150   1389 1991-04-05
40  TPO55093M    Timothy     P   O'Rourke      13      100   0736 1988-06-19
41  VPA30890F   Victoria     P   Ashworth       6      140   0877 1990-09-13
42  Y-L77953M      Yoshi          Latimer      12       32   1389 1989-06-11

In [171]:
from sqlalchemy import inspect

In [173]:
inspector=inspect(engine)

In [174]:
inspector.get_table_names()

['authors',
 'discounts',
 'employee',
 'jobs',
 'new_employee',
 'pub_info',
 'publishers',
 'roysched',
 'sales',
 'stores',
 'titleauthor',
 'titles']

In [185]:
df.to_sql('new_authors', engine, if_exists='replace', index=False)

Finance data

In [188]:
os.chdir(r'D:\Downloads\Czech')

In [189]:
os.listdir()

['account.asc',
 'berka.pdf',
 'card.asc',
 'client.asc',
 'disp.asc',
 'district.asc',
 'loan.asc',
 'order.asc',
 'trans.asc']

In [190]:
engine=create_engine(f'mysql+pymysql://{username}:{password}@{server}/new_finance')

In [196]:
ddf={i[:-4]:pd.read_csv(i, sep=';') for i in os.listdir() if i.endswith('.asc')}

In [197]:
ddf.keys()

dict_keys(['account', 'card', 'client', 'disp', 'district', 'loan', 'order', 'trans'])

In [198]:
for i,j in ddf.items():
    j.to_sql(i, engine, index=False)
    print(i, 'is done')